manual_run/172.31.50.13_4m-detector.log
hostname=ip-172-31-50-13, be=0, 64-bit, os=Linux, arch=x86-64, fio=fio-3.19-44-g8dbd-dirty, flags=1
<ip-172-31-50-13> 4m-detector-write-split: (g=0): rw=write, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=posixaio, iodepth=4
<ip-172-31-50-13> 4m-detector-prelayout: (g=0): rw=read, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=posixaio, iodepth=4
<ip-172-31-50-13> ...
<ip-172-31-50-13> Starting 5 processes
<ip-172-31-50-13> 4m-detector-write-split: Laying out IO files (5000 files / total 20000MiB)
<ip-172-31-50-13> 4m-detector-prelayout: Laying out IO files (4998 files / total 19992MiB)
<ip-172-31-50-13> 4m-detector-prelayout: you need to specify size=
<ip-172-31-50-13> fio: pid=0, err=22/file:filesetup.c:1057, func=total_file_size, error=Invalid argument
<ip-172-31-50-13> 4m-detector-prelayout: you need to specify size=
<ip-172-31-50-13> fio: pid=0, err=22/file:filesetup.c:1057, func=total_file_size, error=Invalid argument
<ip-172-31-50-13> 4m-detector-prelayout: you need to specify size=
<ip-172-31-50-13> fio: pid=0, err=22/file:filesetup.c:1057, func=total_file_size, error=Invalid argument
<ip-172-31-50-13> 
client <172.31.50.13>: exited with error 3
4m-detector-write-split: (groupid=0, jobs=5): err=22 (file:filesetup.c:1057, func=total_file_size, error=Invalid argument): pid=33335: Sun Apr 19 10:43:37 2020
  Description  : ['detector write, separate workloads']
  read: IOPS=255, BW=1024MiB/s (1074MB/s)(190GiB/190090msec)
    slat (nsec): min=1000, max=32286, avg=2928.00, stdev=1217.67
    clat (usec): min=2421, max=16185, avg=3545.46, stdev=1254.97
     lat (usec): min=2423, max=16187, avg=3548.38, stdev=1254.94
    clat percentiles (usec):
     |  1.00th=[ 2638],  5.00th=[ 2737], 10.00th=[ 2802], 20.00th=[ 2868],
     | 30.00th=[ 2900], 40.00th=[ 2966], 50.00th=[ 3032], 60.00th=[ 3130],
     | 70.00th=[ 3326], 80.00th=[ 4113], 90.00th=[ 5145], 95.00th=[ 5669],
     | 99.00th=[ 9765], 99.50th=[10814], 99.90th=[12518], 99.95th=[13173],
     | 99.99th=[14877]
   bw (  MiB/s): min=  871, max= 1152, per=100.00%, avg=1024.97, stdev=39.48, samples=379
   iops        : min=  217, max=  288, avg=256.24, stdev= 9.87, samples=379
  write: IOPS=99, BW=397MiB/s (416MB/s)(95.9GiB/247344msec); 0 zone resets
    slat (usec): min=44, max=267, avg=104.90, stdev=30.99
    clat (usec): min=1177, max=1710, avg=1254.52, stdev=44.23
     lat (usec): min=1232, max=1949, avg=1359.42, stdev=62.22
    clat percentiles (usec):
     |  1.00th=[ 1188],  5.00th=[ 1205], 10.00th=[ 1205], 20.00th=[ 1221],
     | 30.00th=[ 1221], 40.00th=[ 1237], 50.00th=[ 1254], 60.00th=[ 1270],
     | 70.00th=[ 1270], 80.00th=[ 1287], 90.00th=[ 1319], 95.00th=[ 1336],
     | 99.00th=[ 1385], 99.50th=[ 1418], 99.90th=[ 1483], 99.95th=[ 1516],
     | 99.99th=[ 1565]
   bw (  KiB/s): min=335872, max=442368, per=100.00%, avg=406907.46, stdev=14629.75, samples=493
   iops        : min=   82, max=  108, avg=99.34, stdev= 3.58, samples=493
  lat (msec)   : 2=33.53%, 4=52.92%, 10=12.95%, 20=0.61%
  cpu          : usr=0.79%, sys=6.27%, ctx=2069621, majf=0, minf=170
  IO depths    : 1=98.9%, 2=0.3%, 4=0.8%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=48659,24541,0,0 short=0,0,0,0 dropped=0,0,0,0

Run status group 0 (all jobs):
   READ: bw=1024MiB/s (1074MB/s), 1024MiB/s-1024MiB/s (1074MB/s-1074MB/s), io=190GiB (204GB), run=190090-190090msec
  WRITE: bw=397MiB/s (416MB/s), 397MiB/s-397MiB/s (416MB/s-416MB/s), io=95.9GiB (103GB), run=247344-247344msec
### (1) done 172.31.50.13_4m-detector #############################################