manual_run/172.31.53.141_1m-detector.log
hostname=ip-172-31-53-141, be=0, 64-bit, os=Linux, arch=x86-64, fio=fio-3.19-44-g8dbd-dirty, flags=1
<ip-172-31-53-141> 1m-detector-write-split: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=posixaio, iodepth=4
<ip-172-31-53-141> 1m-detector-prelayout: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=posixaio, iodepth=4
<ip-172-31-53-141> ...
<ip-172-31-53-141> Starting 5 processes
<ip-172-31-53-141> 1m-detector-write-split: Laying out IO files (5000 files / total 5000MiB)
<ip-172-31-53-141> 1m-detector-prelayout: you need to specify size=
<ip-172-31-53-141> fio: pid=0, err=22/file:filesetup.c:1057, func=total_file_size, error=Invalid argument
<ip-172-31-53-141> 1m-detector-prelayout: you need to specify size=
<ip-172-31-53-141> fio: pid=0, err=22/file:filesetup.c:1057, func=total_file_size, error=Invalid argument
<ip-172-31-53-141> 1m-detector-prelayout: you need to specify size=
<ip-172-31-53-141> fio: pid=0, err=22/file:filesetup.c:1057, func=total_file_size, error=Invalid argument
<ip-172-31-53-141> 
client <172.31.53.141>: exited with error 3
1m-detector-write-split: (groupid=0, jobs=5): err=22 (file:filesetup.c:1057, func=total_file_size, error=Invalid argument): pid=28977: Sun Apr 19 10:44:06 2020
  Description  : ['detector write, separate workloads']
  read: IOPS=451, BW=451MiB/s (473MB/s)(46.6GiB/105734msec)
    slat (nsec): min=940, max=22798, avg=1942.66, stdev=917.11
    clat (usec): min=1196, max=8075, avg=1884.35, stdev=566.20
     lat (usec): min=1198, max=8077, avg=1886.30, stdev=566.20
    clat percentiles (usec):
     |  1.00th=[ 1401],  5.00th=[ 1467], 10.00th=[ 1500], 20.00th=[ 1549],
     | 30.00th=[ 1598], 40.00th=[ 1647], 50.00th=[ 1696], 60.00th=[ 1778],
     | 70.00th=[ 1876], 80.00th=[ 2073], 90.00th=[ 2474], 95.00th=[ 2933],
     | 99.00th=[ 4490], 99.50th=[ 4752], 99.90th=[ 5407], 99.95th=[ 5735],
     | 99.99th=[ 6325]
   bw (  KiB/s): min=423935, max=534528, per=100.00%, avg=462420.93, stdev=19114.29, samples=210
   iops        : min=  413, max=  522, avg=451.58, stdev=18.66, samples=210
  write: IOPS=297, BW=297MiB/s (312MB/s)(22.9GiB/78991msec); 0 zone resets
    slat (nsec): min=12745, max=83180, avg=25343.08, stdev=4550.62
    clat (usec): min=296, max=443, avg=343.05, stdev=31.20
     lat (usec): min=312, max=472, avg=368.39, stdev=29.86
    clat percentiles (usec):
     |  1.00th=[  302],  5.00th=[  306], 10.00th=[  306], 20.00th=[  310],
     | 30.00th=[  314], 40.00th=[  318], 50.00th=[  363], 60.00th=[  367],
     | 70.00th=[  367], 80.00th=[  371], 90.00th=[  379], 95.00th=[  383],
     | 99.00th=[  396], 99.50th=[  404], 99.90th=[  412], 99.95th=[  420],
     | 99.99th=[  429]
   bw (  KiB/s): min=276480, max=337920, per=100.00%, avg=304993.60, stdev=11450.78, samples=157
   iops        : min=  270, max=  330, avg=297.84, stdev=11.19, samples=157
  lat (usec)   : 500=33.00%
  lat (msec)   : 2=51.75%, 4=13.73%, 10=1.53%
  cpu          : usr=0.54%, sys=4.43%, ctx=732272, majf=0, minf=134
  IO depths    : 1=98.8%, 2=0.3%, 4=0.8%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=47707,23493,0,0 short=0,0,0,0 dropped=0,0,0,0

Run status group 0 (all jobs):
   READ: bw=451MiB/s (473MB/s), 451MiB/s-451MiB/s (473MB/s-473MB/s), io=46.6GiB (50.0GB), run=105734-105734msec
  WRITE: bw=297MiB/s (312MB/s), 297MiB/s-297MiB/s (312MB/s-312MB/s), io=22.9GiB (24.6GB), run=78991-78991msec
### (3) done 172.31.53.141_1m-detector #############################################