manual_run/172.31.61.152_4m-detector.log
hostname=ip-172-31-61-152, be=0, 64-bit, os=Linux, arch=x86-64, fio=fio-3.19-44-g8dbd-dirty, flags=1
<ip-172-31-61-152> 4m-detector-write-split: (g=0): rw=write, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=posixaio, iodepth=4
<ip-172-31-61-152> 4m-detector-prelayout: (g=0): rw=read, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=posixaio, iodepth=4
<ip-172-31-61-152> ...
<ip-172-31-61-152> Starting 5 processes
<ip-172-31-61-152> 4m-detector-write-split: Laying out IO files (5000 files / total 20000MiB)
<ip-172-31-61-152> 4m-detector-prelayout: Laying out IO files (4998 files / total 19992MiB)
<ip-172-31-61-152> 4m-detector-prelayout: you need to specify size=
<ip-172-31-61-152> fio: pid=0, err=22/file:filesetup.c:1057, func=total_file_size, error=Invalid argument
<ip-172-31-61-152> 4m-detector-prelayout: you need to specify size=
<ip-172-31-61-152> fio: pid=0, err=22/file:filesetup.c:1057, func=total_file_size, error=Invalid argument
<ip-172-31-61-152> 4m-detector-prelayout: you need to specify size=
<ip-172-31-61-152> fio: pid=0, err=22/file:filesetup.c:1057, func=total_file_size, error=Invalid argument
<ip-172-31-61-152> 
client <172.31.61.152>: exited with error 3
4m-detector-write-split: (groupid=0, jobs=5): err=22 (file:filesetup.c:1057, func=total_file_size, error=Invalid argument): pid=27584: Sun Apr 19 10:32:48 2020
  Description  : ['detector write, separate workloads']
  read: IOPS=237, BW=949MiB/s (995MB/s)(191GiB/205580msec)
    slat (nsec): min=929, max=27997, avg=3039.60, stdev=1145.68
    clat (usec): min=2564, max=16419, avg=3776.99, stdev=1201.39
     lat (usec): min=2568, max=16421, avg=3780.03, stdev=1201.33
    clat percentiles (usec):
     |  1.00th=[ 2769],  5.00th=[ 2900], 10.00th=[ 2966], 20.00th=[ 3064],
     | 30.00th=[ 3130], 40.00th=[ 3228], 50.00th=[ 3326], 60.00th=[ 3490],
     | 70.00th=[ 3720], 80.00th=[ 4359], 90.00th=[ 5276], 95.00th=[ 5800],
     | 99.00th=[ 9765], 99.50th=[10814], 99.90th=[12256], 99.95th=[12780],
     | 99.99th=[13829]
   bw (  KiB/s): min=892927, max=1097728, per=100.00%, avg=972802.88, stdev=33702.17, samples=410
   iops        : min=  217, max=  268, avg=237.50, stdev= 8.23, samples=410
  write: IOPS=97, BW=389MiB/s (408MB/s)(95.9GiB/252691msec); 0 zone resets
    slat (usec): min=44, max=356, avg=108.80, stdev=41.34
    clat (usec): min=1170, max=1796, avg=1251.22, stdev=45.04
     lat (usec): min=1227, max=2026, avg=1360.01, stdev=74.20
    clat percentiles (usec):
     |  1.00th=[ 1188],  5.00th=[ 1205], 10.00th=[ 1205], 20.00th=[ 1205],
     | 30.00th=[ 1221], 40.00th=[ 1221], 50.00th=[ 1254], 60.00th=[ 1254],
     | 70.00th=[ 1270], 80.00th=[ 1287], 90.00th=[ 1319], 95.00th=[ 1336],
     | 99.00th=[ 1369], 99.50th=[ 1401], 99.90th=[ 1483], 99.95th=[ 1532],
     | 99.99th=[ 1713]
   bw (  KiB/s): min=319488, max=458752, per=100.00%, avg=398451.02, stdev=19278.60, samples=504
   iops        : min=   78, max=  112, avg=97.28, stdev= 4.71, samples=504
  lat (msec)   : 2=33.48%, 4=51.00%, 10=14.93%, 20=0.59%
  cpu          : usr=0.78%, sys=5.88%, ctx=2163846, majf=0, minf=177
  IO depths    : 1=98.9%, 2=0.3%, 4=0.8%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=48777,24551,0,0 short=0,0,0,0 dropped=0,0,0,0

Run status group 0 (all jobs):
   READ: bw=949MiB/s (995MB/s), 949MiB/s-949MiB/s (995MB/s-995MB/s), io=191GiB (205GB), run=205580-205580msec
  WRITE: bw=389MiB/s (408MB/s), 389MiB/s-389MiB/s (408MB/s-408MB/s), io=95.9GiB (103GB), run=252691-252691msec
### (5) done 172.31.61.152_4m-detector #############################################